; domain
(define (domain pl1_1_domain)

    (:requirements :strips :typing)
    (:types
        dron brazo humano caja ubicacion contenido - object
    )

    (:predicates
        (ubicacion-humano ?h - humano ?u - ubicacion)

        (humano-necesita ?h - humano ?con - contenido)

        (humano-satisfecho ?h - humano ?con - contenido)

        (ubicacion-dron ?d - dron ?u - ubicacion)

        (brazo-ocupado ?d - dron ?b - brazo ?c - caja ?con - contenido)
        (free-brazo ?d - dron ?b - brazo)
        (brazo-dron ?d - dron ?b - brazo)

        (ubicacion-caja ?c - caja ?u - ubicacion)
        (contenido-caja ?con - contenido ?c - caja)

    )

    (:action coger_caja
        :parameters (?u - ubicacion ?d - dron ?b - brazo ?c - caja ?con - contenido)
        :precondition (and
            (brazo-dron ?d ?b)
            (ubicacion-dron ?d ?u)
            (ubicacion-caja ?c ?u)
            (contenido-caja ?con ?c)
            (free-brazo ?d ?b)
        )
        :effect (and
            (not(free-brazo ?d ?b))
            (brazo-ocupado ?d ?b ?c ?con)
        )
    )

    (:action volar
        :parameters (?d - dron ?origen - ubicacion ?destino - ubicacion)
        :precondition (and
            (ubicacion-dron ?d ?origen)
        )
        :effect (and
            (not(ubicacion-dron ?d ?origen))
            (ubicacion-dron ?d ?destino)
        )
    )

    (:action entregar_caja
        :parameters (?u - ubicacion ?d - dron ?b - brazo ?c - caja ?con - contenido ?h - humano)
        :precondition (and
            (humano-necesita ?h ?con)
            (ubicacion-dron ?d ?u)
            (ubicacion-humano ?h ?u)
            (contenido-caja ?con ?c)
            (brazo-ocupado ?d ?b ?c ?con)
        )
        :effect (and
            (not(humano-necesita ?h ?con))
            (not(brazo-ocupado ?d ?b ?c ?con))
            (free-brazo ?d ?b)
            (humano-satisfecho ?h ?con)
        )
    )

)

; problem
(define (problem pl1_1_problem2)
    (:domain pl1_1_domain)
    (:objects
        humano1 humano2 - humano
        dron1 - dron
        brazo1 brazo2 - brazo
        caja1 caja2 caja3 - caja
        comida medicina bebida - contenido
        deposito campo hospital mercado - ubicacion
        

    )

    (:init

        (ubicacion-dron dron1 deposito)
        
        (brazo-dron dron1 brazo1)
        (brazo-dron dron1 brazo2)

        (free-brazo dron1 brazo1)
        (free-brazo dron1 brazo2)

        (ubicacion-caja caja1 deposito)
        (ubicacion-caja caja2 deposito)
        (ubicacion-caja caja3 deposito)


        (ubicacion-humano humano1 campo)
        (ubicacion-humano humano2 hospital)


        (contenido-caja comida caja1)
        (contenido-caja bebida caja2)
        (contenido-caja medicina caja3)

        (humano-necesita humano1 comida)
        (humano-necesita humano1 bebida)
        (humano-necesita humano2 medicina)

    )

    (:goal 
        (and
            (humano-satisfecho humano1 comida)
            (humano-satisfecho humano1 bebida)
            (humano-satisfecho humano2 medicina) 

            (ubicacion-dron dron1 deposito)
        )
    )
)

; plan
1. (coger_caja deposito dron1 brazo1 caja2 bebida)
   deleted: (free-brazo dron1 brazo1)
   added: (brazo-ocupado dron1 brazo1 caja2 bebida)
   goals met: 1 of 4
2. (coger_caja deposito dron1 brazo2 caja1 comida)
   deleted: (free-brazo dron1 brazo2)
   added: (brazo-ocupado dron1 brazo2 caja1 comida)
   goals met: 1 of 4
3. (volar dron1 deposito campo)
   deleted: (ubicacion-dron dron1 deposito)
   added: (ubicacion-dron dron1 campo)
   goals met: 0 of 4
4. (entregar_caja campo dron1 brazo2 caja1 comida humano1)
   deleted: (humano-necesita humano1 comida) (brazo-ocupado dron1 brazo2 caja1 comida)
   added: (free-brazo dron1 brazo2) (humano-satisfecho humano1 comida)
   goals met: 1 of 4
5. (entregar_caja campo dron1 brazo1 caja2 bebida humano1)
   deleted: (humano-necesita humano1 bebida) (brazo-ocupado dron1 brazo1 caja2 bebida)
   added: (free-brazo dron1 brazo1) (humano-satisfecho humano1 bebida)
   goals met: 2 of 4
6. (volar dron1 campo deposito)
   deleted: (ubicacion-dron dron1 campo)
   added: (ubicacion-dron dron1 deposito)
   goals met: 3 of 4
7. (coger_caja deposito dron1 brazo2 caja3 medicina)
   deleted: (free-brazo dron1 brazo2)
   added: (brazo-ocupado dron1 brazo2 caja3 medicina)
   goals met: 3 of 4
8. (volar dron1 deposito hospital)
   deleted: (ubicacion-dron dron1 deposito)
   added: (ubicacion-dron dron1 hospital)
   goals met: 2 of 4
9. (entregar_caja hospital dron1 brazo2 caja3 medicina humano2)
   deleted: (humano-necesita humano2 medicina) (brazo-ocupado dron1 brazo2 caja3 medicina)
   added: (free-brazo dron1 brazo2) (humano-satisfecho humano2 medicina)
   goals met: 3 of 4
10. (volar dron1 hospital deposito)
   deleted: (ubicacion-dron dron1 hospital)
   added: (ubicacion-dron dron1 deposito)
   goals met: 4 of 4
